#include <iostream>
#include "init.h"



int main()
{
   /* Написать программу, вычисляющую выражение a * (b + (c / d)) и выводящую
            результат с плавающей точкой, где a, b, c, d – целочисленные константы;*/
/*

    const int a = 8;
    const int b = 7;
    const int c = 6;
    const int d = 5;*/

    float rezult = ((float)a * ((float)b + ((float)c / (float)d)));
    std::cout<<" Rezult = "<<rezult<<std::endl;


   /* Дано целое число, выведите на экран разницу между этим числом и числом 21.
            Если же заданное число больше, чем 21, необходимо вывести удвоенную разницу между этим числом и 21.
            При выполнении задания следует использовать тернарный оператор.*/

/*
    int a = 21;


    a<=21 ? std::cout<<(21-a)<<std::endl : std::cout<<((a-21)*2)<<std::endl;
*/


    //* Написать программу, вычисляющую выражение из первого задания, а переменные для неё инициализировать в другом файле
    //сделано.подключен файл init.h

//* Описать трёхмерный целочисленный массив, размером 3х3х3, указатель на значения внутри массива и
    //при помощи операции разыменования вывести на экран значение центральной ячейки получившегося куба [1][1][1]




    int array[3][3][3]{};
    array[1][1][1]=10;
    int* p;
    p = &array[0][0][0];

    std::cout<<*(p+13)<<std::endl;



    return 0;
}
